{
    "collection_category": "Demo",
    "description": "M. Rosaria Piomelli (born Agrisano) was born in Naples, Italy, on October 24, 1937. She was educated at the Instituto d'Arte (1954, Bachelor of Arts) and Accedemia d'Arte (Master of Arts, 1955) of Naples, and the Massachusetts Institute of Technology (1960, Bachelor of Architecture). Through the 1960s and 1970s she worked at various architecture offices in Italy, New York, and the Netherlands, including at I.M. Pei and Partners from 1971 to 1974 as a project architect. In 1974 she opened her own office in New York City.\n\nFrom 1971 to 1976 Piomelli taught at the City College of New York School of Architecture as an adjunct associate professor, and from 1974 to 1979 taught at the Pratt Institute, where she served as Chair of the Faculty from 1976 to 1979. In 1979 she returned to City College of New York (CCNY) as a distinguished professor. She was appointed Dean of the CCNY School of Architecture in 1980, becoming the first woman to hold a deanship of any school of architecture in the United States. She served in this position until 1983. In 1984 she was Visiting Distinguished Professor at the University of California, Berkeley, and from 1985 to the present she has had the position of full professor at CCNY.\n\nPiomelli has spent much of her career promoting the work of women in architecture. In 1974, as director of the Equal Opportunity Committee for the American Institute of Architects, she organized an exhibit of women architects' work. This exhibit generated a great amount of interest in the standing of women in the profession. She served as a member of the Board of Advisors for the International Archive of Women in Architecture from 1985 to 1995.\n\nPiomelli earned her professional licensure when she became a registered architect of New York State in 1969. She became a member of the American Institute of Architects (AIA) in 1970 and served on various AIA committees throughout the 1970s, including as Commissioner of the Schools of Architecture Committee of the New York City chapter from 1977 to 1979, and Director of the New York City Executive Committee from 1977 to 1979.\n\nPublications by Piomelli include \"Canary Wharf: London in the Third Millenium\" in the March 1991 issue of Zodiac. Publications about Piomelli include information about her work in Susana Torre's book “Women in American Architecture” (1977) and “Insegnare L'Architettura” by M. Vegeto (1994).\n\nThe collection consists of architectural drawings, correspondence, photographs, newspaper clippings, and files that chronicle Piomelli’s life and career.",
    "id": "0ec03786-1452-4b70-9541-b7fc0c103d67",
    "identifier": "Ms1995_007_Piomelli",
    "date": "1960/11/17",
    "title": "M. Rosaria Architectural Papers, 1960-1995 (Ms1995-007)",
    "visibility": true
}
